xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lpuart.c
    if (hlpuart->MspInitCallback == NULL)
    {
      hlpuart->MspInitCallback = HAL_LPUART_MspInit;
    }

    /* Init the low level hardware */
    hlpuart->MspInitCallback(hlpuart);
#else
    /* Init the low level hardware : GPIO, CLOCK */
    HAL_LPUART_MspInit(hlpuart);
#endif /* (USE_HAL_LPUART_REGISTER_CALLBACKS) */
  }

  hlpuart->gState = HAL_LPUART_STATE_BUSY;

  __HAL_LPUART_DISABLE(hlpuart);

  /* Set the LPUART Communication parameters */
  if (LPUART_SetConfig(hlpuart) == HAL_ERROR)
  {
    return HAL_ERROR;
  }

  LPUART_DelayRatioNops(hlpuart);

  if (hlpuart->AdvancedInit.AdvFeatureInit != LPUART_ADVFEATURE_NO_INIT)
  {
    LPUART_AdvFeatureConfig(hlpuart);
  }

  /* Delay 5 kernal clocks */
  LPUART_DelayInLowClock(hlpuart);
  /* In multiprocessor mode, the following bits must be kept cleared:
  - HDSEL bit in the LPUART_CR3 register. */
  CLEAR_BIT(hlpuart->Instance->CR3, (LPUART_CR3_HDSEL));

  if (WakeUpMethod == LPUART_WAKEUPMETHOD_ADDRESSMARK)
  {
    /* If address mark wake up method is chosen, set the LPUART address node */
    MODIFY_REG(hlpuart->Instance->CR2, LPUART_CR2_ADD, ((uint32_t)Address << LPUART_CR2_ADDRESS_LSB_POS));
  }

  /* Set the wake up method by setting the WAKE bit in the CR1 register */
  MODIFY_REG(hlpuart->Instance->CR1, LPUART_CR1_WAKE, WakeUpMethod);

  __HAL_LPUART_ENABLE(hlpuart);

  /* TEACK and/or REACK to check before moving hlpuart->gState and hlpuart->RxState to Ready */
  return (LPUART_CheckIdleState(hlpuart));
}


/**
  * @brief DeInitialize the LPUART peripheral.
  * @param hlpuart LPUART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_DeInit(LPUART_HandleTypeDef *hlpuart)
{
  /* Check the LPUART handle allocation */
  if (hlpuart == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_LPUART_INSTANCE(hlpuart->Instance));

  hlpuart->gState = HAL_LPUART_STATE_BUSY;

  __HAL_LPUART_DISABLE(hlpuart);

  hlpuart->Instance->CR1 = 0x0U;
  hlpuart->Instance->CR2 = 0x0U;
  /* Delay 5 kernal clocks */
  LPUART_DelayInLowClock(hlpuart);
  hlpuart->Instance->CR3 = 0x0U;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  if (hlpuart->MspDeInitCallback == NULL)
  {
    hlpuart->MspDeInitCallback = HAL_LPUART_MspDeInit;
  }
  /* DeInit the low level hardware */
  hlpuart->MspDeInitCallback(hlpuart);
#else
  /* DeInit the low level hardware */
  HAL_LPUART_MspDeInit(hlpuart);
#endif /* (USE_HAL_LPUART_REGISTER_CALLBACKS) */

  hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;
  hlpuart->gState = HAL_LPUART_STATE_RESET;
  hlpuart->RxState = HAL_LPUART_STATE_RESET;

  __HAL_UNLOCK(hlpuart);

  return HAL_OK;
}

/**
  * @brief Initialize the LPUART MSP.
  * @param hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_MspInit(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_MspInit can be implemented in the user file
   */
}

/**
  * @brief DeInitialize the LPUART MSP.
  * @param hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_MspDeInit(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_MspDeInit can be implemented in the user file
   */
}

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User LPUART Callback
  *         To be used instead of the weak predefined callback
  * @param  hlpuart LPUART handle
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_LPUART_TX_BLOCKCOMPLETE_CB_ID Tx Block Complete Callback ID
  *           @arg @ref HAL_LPUART_TX_HALFBLOCKCOMPLETE_CB_ID Tx Half Block Complete Callback ID
  *           @arg @ref HAL_LPUART_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *           @arg @ref HAL_LPUART_RX_BLOCKCOMPLETE_CB_ID Rx Block Complete Callback ID
  *           @arg @ref HAL_LPUART_RX_HALFBLOCKCOMPLETE_CB_ID Rx Half Block Complete Callback ID
  *           @arg @ref HAL_LPUART_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref HAL_LPUART_ERROR_CB_ID Error Callback ID
  *           @arg @ref HAL_LPUART_ABORT_COMPLETE_CB_ID Abort Complete Callback ID
  *           @arg @ref HAL_LPUART_ABORT_TRANSMIT_COMPLETE_CB_ID Abort Transmit Complete Callback ID
  *           @arg @ref HAL_LPUART_ABORT_RECEIVE_COMPLETE_CB_ID Abort Receive Complete Callback ID
  *           @arg @ref HAL_LPUART_WAKEUP_CB_ID Wakeup Callback ID
  *           @arg @ref HAL_LPUART_MSPINIT_CB_ID MspInit Callback ID
  *           @arg @ref HAL_LPUART_MSPDEINIT_CB_ID MspDeInit Callback ID
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_RegisterCallback(LPUART_HandleTypeDef *hlpuart, HAL_LPUART_CallbackIDTypeDef CallbackID,
                                            pLPUART_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    hlpuart->ErrorCode |= HAL_LPUART_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }

  __HAL_LOCK(hlpuart);

  if (hlpuart->gState == HAL_LPUART_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_LPUART_TX_BLOCKCOMPLETE_CB_ID :
        hlpuart->TxBlockCpltCallback = pCallback;
        break;

      case HAL_LPUART_TX_HALFBLOCKCOMPLETE_CB_ID :
        hlpuart->TxHalfBlockCpltCallback = pCallback;
        break;

      case HAL_LPUART_TX_COMPLETE_CB_ID :
        hlpuart->TxCpltCallback = pCallback;
        break;

      case HAL_LPUART_RX_BLOCKCOMPLETE_CB_ID :
        hlpuart->RxBlockCpltCallback = pCallback;
        break;

