xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lpuart.c
        status =  HAL_ERROR;
        break;
    }
  }
  else if (HAL_LPUART_STATE_RESET == hlpuart->gState)
  {
    switch (CallbackID)
    {
      case HAL_LPUART_MSPINIT_CB_ID :
        hlpuart->MspInitCallback = HAL_LPUART_MspInit;
        break;

      case HAL_LPUART_MSPDEINIT_CB_ID :
        hlpuart->MspDeInitCallback = HAL_LPUART_MspDeInit;
        break;

      default :
        hlpuart->ErrorCode |= HAL_LPUART_ERROR_INVALID_CALLBACK;

        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    hlpuart->ErrorCode |= HAL_LPUART_ERROR_INVALID_CALLBACK;

    status =  HAL_ERROR;
  }

  __HAL_UNLOCK(hlpuart);

  return status;
}
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup LPUART_Exported_Functions_Group2 IO operation functions
  * @brief LPUART Transmit/Receive functions
  *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    This subsection provides a set of functions allowing to manage the LPUART asynchronous
    and Half duplex data transfers.

    (#) There are two mode of transfer:
       (+) Blocking mode: The communication is performed in polling mode.
           The HAL status of all data processing is returned by the same function
           after finishing transfer.
       (+) Non-Blocking mode: The communication is performed using Interrupts
           or DMA, These API's return the HAL status.
           The end of the data processing will be indicated through the
           dedicated LPUART IRQ when using Interrupt mode or the DMA IRQ when
           using DMA mode.
           The HAL_LPUART_TxCpltCallback(), HAL_LPUART_RxCpltCallback() user callbacks
           will be executed respectively at the end of the transmit or Receive process
           The HAL_LPUART_ErrorCallback()user callback will be executed when a communication error is detected

    (#) Blocking mode API's are :
        (+) HAL_LPUART_Transmit()
        (+) HAL_LPUART_Receive()

    (#) Non-Blocking mode API's with Interrupt are :
        (+) HAL_LPUART_Transmit_IT()
        (+) HAL_LPUART_Receive_IT()
        (+) HAL_LPUART_IRQHandler()

    (#) Non-Blocking mode API's with DMA are :
        (+) HAL_LPUART_Transmit_DMA()
        (+) HAL_LPUART_Receive_DMA()
        (+) HAL_LPUART_DMAPause()
        (+) HAL_LPUART_DMAResume()
        (+) HAL_LPUART_DMAStop()

    (#) A set of Transfer Complete Callbacks are provided in Non_Blocking mode:
        (+) HAL_LPUART_TxBlockCpltCallback()
        (+) HAL_LPUART_TxHalfBlockCpltCallback()
        (+) HAL_LPUART_TxCpltCallback()
        (+) HAL_LPUART_RxBlockCpltCallback()
        (+) HAL_LPUART_RxHalfBlockCpltCallback()
        (+) HAL_LPUART_RxCpltCallback()
        (+) HAL_LPUART_ErrorCallback()

    (#) Non-Blocking mode transfers could be aborted using Abort API's :
        (+) HAL_LPUART_Abort()
        (+) HAL_LPUART_AbortTransmit()
        (+) HAL_LPUART_AbortReceive()
        (+) HAL_LPUART_Abort_IT()
        (+) HAL_LPUART_AbortTransmit_IT()
        (+) HAL_LPUART_AbortReceive_IT()

    (#) For Abort services based on interrupts (HAL_LPUART_Abortxxx_IT), a set of Abort Complete Callbacks are provided:
        (+) HAL_LPUART_AbortCpltCallback()
        (+) HAL_LPUART_AbortTransmitCpltCallback()
        (+) HAL_LPUART_AbortReceiveCpltCallback()

    (#) In Non-Blocking mode transfers, possible errors are split into 2 categories.
        Errors are handled as follows :
       (+) Error is considered as Recoverable and non blocking : Transfer could go till end, but error severity is
           to be evaluated by user : this concerns Frame Error, Parity Error or Noise Error
           in Interrupt mode reception .
           Received character is then retrieved and stored in Rx buffer, Error code is set to allow user
           to identify error type, and HAL_LPUART_ErrorCallback() user callback is executed.
           Transfer is kept ongoing on LPUART side.
           If user wants to abort it, Abort services should be called by user.
       (+) Error is considered as Blocking : Transfer could not be completed properly and is aborted.
           This concerns Overrun Error In Interrupt mode reception and all errors in DMA mode.
           Error code is set to allow user to identify error type, and HAL_LPUART_ErrorCallback()
           user callback is executed.

    -@- In the Half duplex communication, it is forbidden to run the transmit
        and receive process in parallel, the LPUART state HAL_LPUART_STATE_BUSY_TX_RX can't be useful.

@endverbatim
  * @{
  */

/**
  * @}
  */

/**
  * @brief Send an amount of data in blocking mode.
  * @note   When LPUART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the sent data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 provided through pData.
  * @param hlpuart   LPUART handle.
  * @param pData   Pointer to data buffer (u8 or u16 data elements).
  * @param Size    Amount of data elements (u8 or u16 or u32) to be sent.
  * @param Timeout Timeout duration.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_Transmit(LPUART_HandleTypeDef *hlpuart, uint8_t *pData, uint32_t Size, uint32_t Timeout)
{
  uint8_t  *pdata8bits;
  uint16_t *pdata16bits;
  uint32_t tickstart;

  /* Check that a Tx process is not already ongoing */
  if (hlpuart->gState == HAL_LPUART_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return  HAL_ERROR;
    }

    __HAL_LOCK(hlpuart);

    hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;
    hlpuart->gState = HAL_LPUART_STATE_BUSY_TX;

    /* Init tickstart for timeout management */
    tickstart = HAL_GetTick();

    hlpuart->TxXferSize  = Size;
    hlpuart->TxXferCount = Size;

    /* In case of 9bits/No Parity transfer, pData needs to be handled as a uint16_t pointer */
    if ((hlpuart->Init.WordLength == LPUART_WORDLENGTH_9B) && (hlpuart->Init.Parity == LPUART_PARITY_NONE))
    {
      pdata8bits  = NULL;
      pdata16bits = (uint16_t *) pData;
    }
    else
    {
      pdata8bits  = pData;
      pdata16bits = NULL;
    }

