xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lpuart.c
    __HAL_UNLOCK(hlpuart);

    /* Enable the LPUART Parity Error interrupt and Data Register Not Empty interrupt */
    SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_PEIE | LPUART_CR1_RXNEIE);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Send an amount of data in DMA mode.
  * @note   When LPUART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the sent data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 provided through pData.
  * @param hlpuart LPUART handle.
  * @param pData Pointer to data buffer (u8 or u16 data elements).
  * @param Size  Amount of data elements (u8 or u16 or u32) to be sent.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_Transmit_DMA(LPUART_HandleTypeDef *hlpuart, uint8_t *pData, uint32_t Size)
{
  /* Check that a Tx process is not already ongoing */
  if (hlpuart->gState == HAL_LPUART_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return HAL_ERROR;
    }

    __HAL_LOCK(hlpuart);

    hlpuart->pTxBuffPtr  = pData;
    hlpuart->TxXferSize  = Size;
    hlpuart->TxXferCount = Size;

    hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;
    hlpuart->gState = HAL_LPUART_STATE_BUSY_TX;

    if (hlpuart->hdmatx != NULL)
    {
      /* Set the LPUART DMA transfer complete callback */
      hlpuart->hdmatx->XferCpltCallback = LPUART_DMATransmitCplt;

      /* Set the LPUART DMA Block transfer complete callback */
      hlpuart->hdmatx->XferBlockCpltCallback = LPUART_DMATxBlockCplt;

      /* Set the LPUART DMA Half Block transfer complete callback */
      hlpuart->hdmatx->XferHalfBlockCpltCallback = LPUART_DMATxHalfBlockCplt;

      /* Set the DMA error callback */
      hlpuart->hdmatx->XferErrorCallback = LPUART_DMAError;

      /* Set the DMA abort callback */
      hlpuart->hdmatx->XferAbortCallback = NULL;

      /* Enable the LPUART transmit DMA channel */
      if (HAL_DMA_Start_IT(hlpuart->hdmatx, (uint32_t)hlpuart->pTxBuffPtr, (uint32_t)&hlpuart->Instance->TDR, Size) != HAL_OK)
      {
        /* Set error code to DMA */
        hlpuart->ErrorCode = HAL_LPUART_ERROR_DMA;

        __HAL_UNLOCK(hlpuart);

        /* Restore hlpuart->gState to ready */
        hlpuart->gState = HAL_LPUART_STATE_READY;

        return HAL_ERROR;
      }
    }
    /* Clear the TC flag in the ICR register */
    __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_TCF);

    __HAL_UNLOCK(hlpuart);

    /* Delay 5 kernal clocks */
    LPUART_DelayInLowClock(hlpuart);
    /* Enable the DMA transfer for transmit request by setting the DMAT bit
    in the LPUART CR3 register */
    SET_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAT);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Receive an amount of data in DMA mode.
  * @note   When the LPUART parity is enabled (PCE = 1), the received data contain
  *         the parity bit (MSB position).
  * @note   When LPUART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the received data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 available through pData.
  * @param hlpuart LPUART handle.
  * @param pData Pointer to data buffer (u8 or u16 data elements).
  * @param Size  Amount of data elements (u8 or u16 or u32) to be received.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_Receive_DMA(LPUART_HandleTypeDef *hlpuart, uint8_t *pData, uint32_t Size)
{
  /* Check that a Rx process is not already ongoing */
  if (hlpuart->RxState == HAL_LPUART_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return HAL_ERROR;
    }

    __HAL_LOCK(hlpuart);

    hlpuart->pRxBuffPtr = pData;
    hlpuart->RxXferSize = Size;

    hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;
    hlpuart->RxState = HAL_LPUART_STATE_BUSY_RX;

    if (hlpuart->hdmarx != NULL)
    {
      /* Set the LPUART DMA transfer complete callback */
      hlpuart->hdmarx->XferCpltCallback = LPUART_DMAReceiveCplt;

      /* Set the LPUART DMA Block transfer complete callback */   
      hlpuart->hdmarx->XferBlockCpltCallback = LPUART_DMARxBlockCplt;

      /* Set the LPUART DMA Half Block transfer complete callback */
      hlpuart->hdmarx->XferHalfBlockCpltCallback = LPUART_DMARxHalfBlockCplt;

      /* Set the DMA error callback */
      hlpuart->hdmarx->XferErrorCallback = LPUART_DMAError;

      /* Set the DMA abort callback */
      hlpuart->hdmarx->XferAbortCallback = NULL;

      /* Enable the DMA channel */
      if (HAL_DMA_Start_IT(hlpuart->hdmarx, (uint32_t)&hlpuart->Instance->RDR, (uint32_t)hlpuart->pRxBuffPtr, Size) != HAL_OK)
      {
        /* Set error code to DMA */
        hlpuart->ErrorCode = HAL_LPUART_ERROR_DMA;

        __HAL_UNLOCK(hlpuart);

        /* Restore hlpuart->gState to ready */
        hlpuart->gState = HAL_LPUART_STATE_READY;

        return HAL_ERROR;
      }
    }
    __HAL_UNLOCK(hlpuart);

    /* Enable the LPUART Parity Error Interrupt */
    SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_PEIE);

    /* Delay 5 kernal clocks */
    LPUART_DelayInLowClock(hlpuart);
    /* Enable the LPUART Error Interrupt: (Frame error, noise error, overrun error) */
    SET_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE);

    /* Delay 5 kernal clocks */
    LPUART_DelayInLowClock(hlpuart);
    /* Enable the DMA transfer for the receiver request by setting the DMAR bit
    in the LPUART CR3 register */
    SET_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Pause the DMA Transfer.
  * @param hlpuart LPUART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_DMAPause(LPUART_HandleTypeDef *hlpuart)
{
  const HAL_LPUART_StateTypeDef gstate = hlpuart->gState;
  const HAL_LPUART_StateTypeDef rxstate = hlpuart->RxState;

