xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lpuart.c
          return HAL_TIMEOUT;
        }
      }
    }
  }

  /* Disable the LPUART DMA Rx request if enabled */
  if (HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR))
  {
    /* Delay 5 kernal clocks */
    LPUART_DelayInLowClock(hlpuart);
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);

    /* Abort the LPUART DMA Rx channel : use blocking DMA Abort API (no callback) */
    if (hlpuart->hdmarx != NULL)
    {
      /* Set the LPUART DMA Abort callback to Null.
         No call back execution at end of DMA abort procedure */
      hlpuart->hdmarx->XferAbortCallback = NULL;

      if (HAL_DMA_Abort(hlpuart->hdmarx) != HAL_OK)
      {
        if (HAL_DMA_GetError(hlpuart->hdmarx) == HAL_DMA_ERROR_TIMEOUT)
        {
          /* Set error code to DMA */
          hlpuart->ErrorCode = HAL_LPUART_ERROR_DMA;

          return HAL_TIMEOUT;
        }
      }
    }
  }

  /* Reset Tx and Rx transfer counters */
  hlpuart->TxXferCount = 0U;
  hlpuart->RxXferCount = 0U;

  /* Clear the Error flags in the ICR register */
  __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF | LPUART_CLEAR_NEF | LPUART_CLEAR_PEF | LPUART_CLEAR_FEF);

  /* Restore hlpuart->gState and hlpuart->RxState to Ready */
  hlpuart->gState  = HAL_LPUART_STATE_READY;
  hlpuart->RxState = HAL_LPUART_STATE_READY;

  hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;

  return HAL_OK;
}

/**
  * @brief  Abort ongoing Transmit transfer (blocking mode).
  * @param  hlpuart LPUART handle.
  * @note   This procedure could be used for aborting any ongoing Tx transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable LPUART Interrupts (Tx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_AbortTransmit(LPUART_HandleTypeDef *hlpuart)
{
  /* Disable TCIE, TXEIE and TXFTIE interrupts */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_TCIE | LPUART_CR1_TXEIE));

  /* Disable the LPUART DMA Tx request if enabled */
  if (HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAT))
  {
    /* Delay 5 kernal clocks */
    LPUART_DelayInLowClock(hlpuart);
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAT);

    /* Abort the LPUART DMA Tx channel : use blocking DMA Abort API (no callback) */
    if (hlpuart->hdmatx != NULL)
    {
      /* Set the LPUART DMA Abort callback to Null.
         No call back execution at end of DMA abort procedure */
      hlpuart->hdmatx->XferAbortCallback = NULL;

      if (HAL_DMA_Abort(hlpuart->hdmatx) != HAL_OK)
      {
        if (HAL_DMA_GetError(hlpuart->hdmatx) == HAL_DMA_ERROR_TIMEOUT)
        {
          /* Set error code to DMA */
          hlpuart->ErrorCode = HAL_LPUART_ERROR_DMA;

          return HAL_TIMEOUT;
        }
      }
    }
  }

  /* Reset Tx transfer counter */
  hlpuart->TxXferCount = 0U;

  /* Restore hlpuart->gState to Ready */
  hlpuart->gState = HAL_LPUART_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  Abort ongoing Receive transfer (blocking mode).
  * @param  hlpuart LPUART handle.
  * @note   This procedure could be used for aborting any ongoing Rx transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable LPUART Interrupts (Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_AbortReceive(LPUART_HandleTypeDef *hlpuart)
{
  /* Disable PEIE, EIE, RXNEIE and RXFTIE interrupts */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_PEIE | LPUART_CR1_RXNEIE));
  /* Delay 5 kernal clocks */
  LPUART_DelayInLowClock(hlpuart);
  CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE);

  /* Disable the LPUART DMA Rx request if enabled */
  if (HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR))
  {
    /* Delay 5 kernal clocks */
    LPUART_DelayInLowClock(hlpuart);
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);

    /* Abort the LPUART DMA Rx channel : use blocking DMA Abort API (no callback) */
    if (hlpuart->hdmarx != NULL)
    {
      /* Set the LPUART DMA Abort callback to Null.
         No call back execution at end of DMA abort procedure */
      hlpuart->hdmarx->XferAbortCallback = NULL;

      if (HAL_DMA_Abort(hlpuart->hdmarx) != HAL_OK)
      {
        if (HAL_DMA_GetError(hlpuart->hdmarx) == HAL_DMA_ERROR_TIMEOUT)
        {
          /* Set error code to DMA */
          hlpuart->ErrorCode = HAL_LPUART_ERROR_DMA;

          return HAL_TIMEOUT;
        }
      }
    }
  }

  /* Reset Rx transfer counter */
  hlpuart->RxXferCount = 0U;

  /* Clear the Error flags in the ICR register */
  __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF | LPUART_CLEAR_NEF | LPUART_CLEAR_PEF | LPUART_CLEAR_FEF);

  /* Restore hlpuart->RxState to Ready */
  hlpuart->RxState = HAL_LPUART_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  Abort ongoing transfers (Interrupt mode).
  * @param  hlpuart LPUART handle.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable LPUART Interrupts (Tx and Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_Abort_IT(LPUART_HandleTypeDef *hlpuart)
{
  uint32_t abortcplt = 1U;

  /* Disable interrupts */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_PEIE | LPUART_CR1_TCIE | LPUART_CR1_TXEIE | LPUART_CR1_RXNEIE));
  /* Delay 5 kernal clocks */
  LPUART_DelayInLowClock(hlpuart);
  CLEAR_BIT(hlpuart->Instance->CR3, (LPUART_CR3_EIE));

  /* If DMA Tx and/or DMA Rx Handles are associated to LPUART handle, DMA Abort complete callbacks should be initialised
     before any call to DMA Abort functions */
  /* DMA Tx Handle is valid */
  if (hlpuart->hdmatx != NULL)
  {
    /* Set DMA Abort Complete callback if LPUART DMA Tx request if enabled.
       Otherwise, set it to NULL */
    if (HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAT))
    {
      hlpuart->hdmatx->XferAbortCallback = LPUART_DMATxAbortCallback;
    }
    else
    {
      hlpuart->hdmatx->XferAbortCallback = NULL;
    }
  }
  /* DMA Rx Handle is valid */
  if (hlpuart->hdmarx != NULL)
  {
    /* Set DMA Abort Complete callback if LPUART DMA Rx request if enabled.
       Otherwise, set it to NULL */
    if (HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR))
    {
      hlpuart->hdmarx->XferAbortCallback = LPUART_DMARxAbortCallback;
    }
    else
    {
      hlpuart->hdmarx->XferAbortCallback = NULL;
    }
  }

