xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lpuart.c
  /* Disable the LPUART DMA Tx request if enabled */
  if (HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAT))
  {
    /* Delay 5 kernal clocks */
    LPUART_DelayInLowClock(hlpuart);
    /* Disable DMA Tx at LPUART level */
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAT);

    /* Abort the LPUART DMA Tx channel : use non blocking DMA Abort API (callback) */
    if (hlpuart->hdmatx != NULL)
    {
      /* LPUART Tx DMA Abort callback has already been initialised :
         will lead to call HAL_LPUART_AbortCpltCallback() at end of DMA abort procedure */

      /* Abort DMA TX */
      if (HAL_DMA_Abort_IT(hlpuart->hdmatx) != HAL_OK)
      {
        hlpuart->hdmatx->XferAbortCallback = NULL;
      }
      else
      {
        abortcplt = 0U;
      }
    }
  }

  /* Disable the LPUART DMA Rx request if enabled */
  if (HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR))
  {
    /* Delay 5 kernal clocks */
    LPUART_DelayInLowClock(hlpuart);
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);

    /* Abort the LPUART DMA Rx channel : use non blocking DMA Abort API (callback) */
    if (hlpuart->hdmarx != NULL)
    {
      /* LPUART Rx DMA Abort callback has already been initialised :
         will lead to call HAL_LPUART_AbortCpltCallback() at end of DMA abort procedure */

      /* Abort DMA RX */
      if (HAL_DMA_Abort_IT(hlpuart->hdmarx) != HAL_OK)
      {
        hlpuart->hdmarx->XferAbortCallback = NULL;
        abortcplt = 1U;
      }
      else
      {
        abortcplt = 0U;
      }
    }
  }

  /* if no DMA abort complete callback execution is required => call user Abort Complete callback */
  if (abortcplt == 1U)
  {
    /* Reset Tx and Rx transfer counters */
    hlpuart->TxXferCount = 0U;
    hlpuart->RxXferCount = 0U;

    /* Clear ISR function pointers */
    hlpuart->RxISR = NULL;
    hlpuart->TxISR = NULL;

    /* Reset errorCode */
    hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;

    /* Clear the Error flags in the ICR register */
    __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF | LPUART_CLEAR_NEF | LPUART_CLEAR_PEF | LPUART_CLEAR_FEF);

    /* Restore hlpuart->gState and hlpuart->RxState to Ready */
    hlpuart->gState  = HAL_LPUART_STATE_READY;
    hlpuart->RxState = HAL_LPUART_STATE_READY;

    /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
    /* Call registered Abort complete callback */
    hlpuart->AbortCpltCallback(hlpuart);
#else
    /* Call legacy weak Abort complete callback */
    HAL_LPUART_AbortCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}

/**
  * @brief  Abort ongoing Transmit transfer (Interrupt mode).
  * @param  hlpuart LPUART handle.
  * @note   This procedure could be used for aborting any ongoing Tx transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable LPUART Interrupts (Tx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_AbortTransmit_IT(LPUART_HandleTypeDef *hlpuart)
{
  /* Disable interrupts */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_TCIE | LPUART_CR1_TXEIE));

  /* Disable the LPUART DMA Tx request if enabled */
  if (HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAT))
  {
    /* Delay 5 kernal clocks */
    LPUART_DelayInLowClock(hlpuart);
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAT);

    /* Abort the LPUART DMA Tx channel : use non blocking DMA Abort API (callback) */
    if (hlpuart->hdmatx != NULL)
    {
      /* Set the LPUART DMA Abort callback :
         will lead to call HAL_LPUART_AbortCpltCallback() at end of DMA abort procedure */
      hlpuart->hdmatx->XferAbortCallback = LPUART_DMATxOnlyAbortCallback;

      /* Abort DMA TX */
      if (HAL_DMA_Abort_IT(hlpuart->hdmatx) != HAL_OK)
      {
        /* Call Directly hlpuart->hdmatx->XferAbortCallback function in case of error */
        hlpuart->hdmatx->XferAbortCallback(hlpuart->hdmatx);
      }
    }
    else
    {
      /* Reset Tx transfer counter */
      hlpuart->TxXferCount = 0U;

      /* Clear TxISR function pointers */
      hlpuart->TxISR = NULL;

      /* Restore hlpuart->gState to Ready */
      hlpuart->gState = HAL_LPUART_STATE_READY;

      /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
      /* Call registered Abort Transmit Complete Callback */
      hlpuart->AbortTransmitCpltCallback(hlpuart);
#else
      /* Call legacy weak Abort Transmit Complete Callback */
      HAL_LPUART_AbortTransmitCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
    }
  }
  else
  {
    /* Reset Tx transfer counter */
    hlpuart->TxXferCount = 0U;

    /* Clear TxISR function pointers */
    hlpuart->TxISR = NULL;

    /* Restore hlpuart->gState to Ready */
    hlpuart->gState = HAL_LPUART_STATE_READY;

    /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
    /* Call registered Abort Transmit Complete Callback */
    hlpuart->AbortTransmitCpltCallback(hlpuart);
#else
    /* Call legacy weak Abort Transmit Complete Callback */
    HAL_LPUART_AbortTransmitCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}

/**
  * @brief  Abort ongoing Receive transfer (Interrupt mode).
  * @param  hlpuart LPUART handle.
  * @note   This procedure could be used for aborting any ongoing Rx transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable LPUART Interrupts (Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_AbortReceive_IT(LPUART_HandleTypeDef *hlpuart)
{
  /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_PEIE | LPUART_CR1_RXNEIE));
  /* Delay 5 kernal clocks */
  LPUART_DelayInLowClock(hlpuart);
  CLEAR_BIT(hlpuart->Instance->CR3, (LPUART_CR3_EIE));

