xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lpuart.c
            /* Abort DMA RX */
            if (HAL_DMA_Abort_IT(hlpuart->hdmarx) != HAL_OK)
            {
              /* Call Directly hlpuart->hdmarx->XferAbortCallback function in case of error */
              hlpuart->hdmarx->XferAbortCallback(hlpuart->hdmarx);
            }
          }
          else
          {
            /* Call user error callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
            /*Call registered error callback*/
            hlpuart->ErrorCallback(hlpuart);
#else
            /*Call legacy weak error callback*/
            HAL_LPUART_ErrorCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */

          }
        }
        else
        {
          /* Call user error callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
          /*Call registered error callback*/
          hlpuart->ErrorCallback(hlpuart);
#else
          /*Call legacy weak error callback*/
          HAL_LPUART_ErrorCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
        }
      }
      else
      {
        /* Non Blocking error : transfer could go on.
           Error is notified to user through user error callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
        /*Call registered error callback*/
        hlpuart->ErrorCallback(hlpuart);
#else
        /*Call legacy weak error callback*/
        HAL_LPUART_ErrorCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
        hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;
      }
    }
    return;

  } /* End if some error occurs */

  /* LPUART wakeup from Stop mode interrupt occurred ---------------------------*/
  if (((isrflags & LPUART_ISR_WUF) != 0U) && ((cr3its & LPUART_CR3_WUFIE) != 0U))
  {
    __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_WUF);

    /* LPUART Rx state is not reset as a reception process might be ongoing.
       If LPUART handle state fields need to be reset to READY, this could be done in Wakeup callback */

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
    /* Call registered Wakeup Callback */
    hlpuart->WakeupCallback(hlpuart);
#else
    /* Call legacy weak Wakeup Callback */
    HAL_LPUARTEx_WakeupCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
    return;
  }

  /* LPUART in mode Transmitter ------------------------------------------------*/
  if (((isrflags & LPUART_ISR_TXE) != 0U)
      && ((cr1its & LPUART_CR1_TXEIE) != 0U))
  {
    if (hlpuart->TxISR != NULL)
    {
      hlpuart->TxISR(hlpuart);
    }
    return;
  }

  /* LPUART in mode Transmitter (transmission end) -----------------------------*/
  if (((isrflags & LPUART_ISR_TC) != 0U) && ((cr1its & LPUART_CR1_TCIE) != 0U))
  {
    LPUART_EndTransmit_IT(hlpuart);
    return;
  }
}

/**
  * @brief Tx Transfer completed callback.
  * @param hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_TxCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_TxCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Tx Block Transfer completed callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_TxBlockCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_LPUART_TxBlockCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Tx Half Block Transfer completed callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_TxHalfBlockCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_LPUART_TxHalfBlockCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Rx Transfer completed callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_RxCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_RxCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Rx Block Transfer completed callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_RxBlockCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_LPUART_RxBlockCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Rx Half Block Transfer completed callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_RxHalfBlockCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_LPUART_RxHalfBlockCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  LPUART error callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_ErrorCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_ErrorCallback can be implemented in the user file.
   */
}

/**
  * @brief  LPUART Abort Complete callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_AbortCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_AbortCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  LPUART Abort Complete callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_AbortTransmitCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_AbortTransmitCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  LPUART Abort Receive Complete callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_AbortReceiveCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_AbortReceiveCpltCallback can be implemented in the user file.
   */
}

/**
  * @}
  */

/** @defgroup LPUART_Exported_Functions_Group3 Peripheral Control functions
  *  @brief   LPUART control functions
  *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the LPUART.
     (+) HAL_MultiProcessor_EnableMuteMode() API enables mute mode
     (+) HAL_MultiProcessor_DisableMuteMode() API disables mute mode
     (+) HAL_MultiProcessor_EnterMuteMode() API enters mute mode
     (+) LPUART_SetConfig() API configures the LPUART peripheral
     (+) LPUART_AdvFeatureConfig() API optionally configures the LPUART advanced features
     (+) LPUART_CheckIdleState() API ensures that TEACK and/or REACK are set after initialization
     (+) HAL_LPUART_HalfDuplex_EnableTransmitter() API disables receiver and enables transmitter
     (+) HAL_LPUART_HalfDuplex_EnableReceiver() API disables transmitter and enables receiver
@endverbatim
  * @{
  */

/**
  * @brief  Enable LPUART in mute mode (does not mean LPUART enters mute mode;
  *         to enter mute mode, HAL_MultiProcessor_EnterMuteMode() API must be called).
  * @param  hlpuart LPUART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_MultiProcessor_EnableMuteMode(LPUART_HandleTypeDef *hlpuart)
{
  __HAL_LOCK(hlpuart);

  hlpuart->gState = HAL_LPUART_STATE_BUSY;

