xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lpuart.c
  /*-------------------------- LPUART CR2 Configuration -----------------------*/
  /* Configure the LPUART Stop Bits: Set STOP[13:12] bits according
  * to hlpuart->Init.StopBits value */
  MODIFY_REG(hlpuart->Instance->CR2, LPUART_CR2_STOP, hlpuart->Init.StopBits);

  /*-------------------------- LPUART CR3 Configuration -----------------------*/
  /* Configure
  * - LPUART HardWare Flow Control: set CTSE and RTSE bits according
  *   to hlpuart->Init.HwFlowCtl value */
  tmpreg = (uint32_t)hlpuart->Init.HwFlowCtl;

  /* Delay 5 kernal clocks */
  LPUART_DelayInLowClock(hlpuart);
  MODIFY_REG(hlpuart->Instance->CR3, LPUART_CR3_FIELDS, tmpreg);

  /*-------------------------- LPUART PRESC Configuration -----------------------*/
  /* Configure
  * - LPUART Clock Prescaler : set PRESCALER according to hlpuart->Init.ClockPrescaler value */
  MODIFY_REG(hlpuart->Instance->PRESC, LPUART_PRESC_PRESCALER, hlpuart->Init.ClockPrescaler);

  /*-------------------------- LPUART BRR Configuration -----------------------*/
  LPUART_GETCLOCKSOURCE(hlpuart, clocksource);

  /* Retrieve frequency clock */
  switch (clocksource)
  {
    case LPUART_CLOCKSOURCE_PCLK:
      pclk = HAL_RCC_GetPCLKFreq();
      break;
    case LPUART_CLOCKSOURCE_SYSCLK:
      pclk = HAL_RCC_GetSysClockFreq();
      break;
    case LPUART_CLOCKSOURCE_LSI:
      pclk = (uint32_t) LSI_VALUE;
      break;
    case LPUART_CLOCKSOURCE_LSE:
      pclk = (uint32_t) LSE_VALUE;
      break;
    default:
      pclk = 0U;
      ret = HAL_ERROR;
      break;
  }

  /* If proper clock source reported */
  if (pclk != 0U)
  {
    /* Compute clock after Prescaler */
    lpuart_ker_ck_pres = (pclk / LPUARTPrescTable[hlpuart->Init.ClockPrescaler]);

    /* Ensure that Frequency clock is in the range [3 * baudrate, 4096 * baudrate] */
    if ((lpuart_ker_ck_pres < (3U * hlpuart->Init.BaudRate)) ||
        (lpuart_ker_ck_pres > (4096U * hlpuart->Init.BaudRate)))
    {
      ret = HAL_ERROR;
    }
    else
    {
      /* Check computed LPUARTDiv value is in allocated range
         (it is forbidden to write values lower than 0x300 in the LPUART_BRR register) */
      LPUARTdiv = (uint32_t)(LPUART_DIV_LPUART(pclk, hlpuart->Init.BaudRate, hlpuart->Init.ClockPrescaler));
      if ((LPUARTdiv >= LPUART_BRR_MIN) && (LPUARTdiv <= LPUART_BRR_MAX))
      {
        hlpuart->Instance->BRR = LPUARTdiv;
      }
      else
      {
        ret = HAL_ERROR;
      }
    } /* if ( (lpuart_ker_ck_pres < (3 * hlpuart->Init.BaudRate) ) ||
              (lpuart_ker_ck_pres > (4096 * hlpuart->Init.BaudRate) )) */
  } /* if (pclk != 0) */
  
  /* Initialize the number of data to process during RX/TX ISR execution */
  hlpuart->NbTxDataToProcess = 1;
  hlpuart->NbRxDataToProcess = 1;

  /* Clear ISR function pointers */
  hlpuart->RxISR = NULL;
  hlpuart->TxISR = NULL;

  return ret;
}

/**
  * @brief Configure the LPUART peripheral advanced features.
  * @param hlpuart LPUART handle.
  * @retval None
  */
void LPUART_AdvFeatureConfig(LPUART_HandleTypeDef *hlpuart)
{
  /* Check whether the set of advanced features to configure is properly set */
  assert_param(IS_LPUART_ADVFEATURE_INIT(hlpuart->AdvancedInit.AdvFeatureInit));

  /* if required, configure TX pin active level inversion */
  if (HAL_IS_BIT_SET(hlpuart->AdvancedInit.AdvFeatureInit, LPUART_ADVFEATURE_TXINVERT_INIT))
  {
    assert_param(IS_LPUART_ADVFEATURE_TXINV(hlpuart->AdvancedInit.TxPinLevelInvert));
    MODIFY_REG(hlpuart->Instance->CR2, LPUART_CR2_TXINV, hlpuart->AdvancedInit.TxPinLevelInvert);
  }

  /* if required, configure RX pin active level inversion */
  if (HAL_IS_BIT_SET(hlpuart->AdvancedInit.AdvFeatureInit, LPUART_ADVFEATURE_RXINVERT_INIT))
  {
    assert_param(IS_LPUART_ADVFEATURE_RXINV(hlpuart->AdvancedInit.RxPinLevelInvert));
    MODIFY_REG(hlpuart->Instance->CR2, LPUART_CR2_RXINV, hlpuart->AdvancedInit.RxPinLevelInvert);
  }

  /* if required, configure data inversion */
  if (HAL_IS_BIT_SET(hlpuart->AdvancedInit.AdvFeatureInit, LPUART_ADVFEATURE_DATAINVERT_INIT))
  {
    assert_param(IS_LPUART_ADVFEATURE_DATAINV(hlpuart->AdvancedInit.DataInvert));
    MODIFY_REG(hlpuart->Instance->CR2, LPUART_CR2_DATAINV, hlpuart->AdvancedInit.DataInvert);
  }

  /* if required, configure RX/TX pins swap */
  if (HAL_IS_BIT_SET(hlpuart->AdvancedInit.AdvFeatureInit, LPUART_ADVFEATURE_SWAP_INIT))
  {
    assert_param(IS_LPUART_ADVFEATURE_SWAP(hlpuart->AdvancedInit.Swap));
    MODIFY_REG(hlpuart->Instance->CR2, LPUART_CR2_SWAP, hlpuart->AdvancedInit.Swap);
  }

  /* if required, configure RX overrun detection disabling */
  if (HAL_IS_BIT_SET(hlpuart->AdvancedInit.AdvFeatureInit, LPUART_ADVFEATURE_RXOVERRUNDISABLE_INIT))
  {
    assert_param(IS_LPUART_OVERRUN(hlpuart->AdvancedInit.OverrunDisable));
    /* Delay 5 kernal clocks */
    LPUART_DelayInLowClock(hlpuart);
    MODIFY_REG(hlpuart->Instance->CR3, LPUART_CR3_OVRDIS, hlpuart->AdvancedInit.OverrunDisable);
  }

  /* if required, configure DMA disabling on reception error */
  if (HAL_IS_BIT_SET(hlpuart->AdvancedInit.AdvFeatureInit, LPUART_ADVFEATURE_DMADISABLEONERROR_INIT))
  {
    assert_param(IS_LPUART_ADVFEATURE_DMAONRXERROR(hlpuart->AdvancedInit.DMADisableonRxError));
    /* Delay 5 kernal clocks */
    LPUART_DelayInLowClock(hlpuart);
    MODIFY_REG(hlpuart->Instance->CR3, LPUART_CR3_DDRE, hlpuart->AdvancedInit.DMADisableonRxError);
  }

  /* if required, configure MSB first on communication line */
  if (HAL_IS_BIT_SET(hlpuart->AdvancedInit.AdvFeatureInit, LPUART_ADVFEATURE_MSBFIRST_INIT))
  {
    assert_param(IS_LPUART_ADVFEATURE_MSBFIRST(hlpuart->AdvancedInit.MSBFirst));
    MODIFY_REG(hlpuart->Instance->CR2, LPUART_CR2_MSBFIRST, hlpuart->AdvancedInit.MSBFirst);
  }
}

/**
  * @brief Check the LPUART Idle State.
  * @param hlpuart LPUART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef LPUART_CheckIdleState(LPUART_HandleTypeDef *hlpuart)
{
  uint32_t tickstart;

  /* Initialize the LPUART ErrorCode */
  hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;

