xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lpuart.c
  /* Init tickstart for timeout management */
  tickstart = HAL_GetTick();

  /* Check if the Transmitter is enabled */
  if ((hlpuart->Instance->CR1 & LPUART_CR1_TE) == LPUART_CR1_TE)
  {
    /* Wait until TEACK flag is set */
    if (LPUART_WaitOnFlagUntilTimeout(hlpuart, LPUART_ISR_TEACK, RESET, tickstart, HAL_LPUART_TIMEOUT_VALUE) != HAL_OK)
    {
      /* Timeout occurred */
      return HAL_TIMEOUT;
    }
  }

  /* Check if the Receiver is enabled */
  if ((hlpuart->Instance->CR1 & LPUART_CR1_RE) == LPUART_CR1_RE)
  {
    /* Wait until REACK flag is set */
    if (LPUART_WaitOnFlagUntilTimeout(hlpuart, LPUART_ISR_REACK, RESET, tickstart, HAL_LPUART_TIMEOUT_VALUE) != HAL_OK)
    {
      /* Timeout occurred */
      return HAL_TIMEOUT;
    }
  }

  /* Initialize the LPUART State */
  hlpuart->gState = HAL_LPUART_STATE_READY;
  hlpuart->RxState = HAL_LPUART_STATE_READY;

  __HAL_UNLOCK(hlpuart);

  return HAL_OK;
}

/**
  * @brief  Handle LPUART Communication Timeout.  Public use
  * @param hlpuart     LPUART handle.
  * @param Flag      Specifies the LPUART flag to check
  * @param Status    Flag status (SET or RESET)
  * @param Tickstart Tick start value
  * @param Timeout   Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef LPUART_WaitOnFlagUntilTimeout(LPUART_HandleTypeDef *hlpuart, uint32_t Flag, FlagStatus Status,
                                              uint32_t Tickstart, uint32_t Timeout)
{
  /* Wait until flag is set */
  while ((__HAL_LPUART_GET_FLAG(hlpuart, Flag) ? SET : RESET) == Status)
  {
    /* Check for the Timeout */
    if (Timeout != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - Tickstart) > Timeout) || (Timeout == 0U))
      {
        return HAL_TIMEOUT;
      }

      if ((READ_BIT(hlpuart->Instance->CR1, USART_CR1_RE) != 0U) && (Flag != UART_FLAG_TXE) && (Flag != LPUART_FLAG_TC))
      {
        if (__HAL_LPUART_GET_FLAG(hlpuart, LPUART_FLAG_ORE) == SET)
        {
          /* Clear Overrun Error flag*/
          __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF);

          /* Blocking error : transfer is aborted
          Set the UART state ready to be able to start again the process,
          Disable Rx Interrupts if ongoing */
          LPUART_EndRxTransfer(hlpuart);

          hlpuart->ErrorCode = HAL_UART_ERROR_ORE;

          /* Process Unlocked */
          __HAL_UNLOCK(hlpuart);

          return HAL_ERROR;
        }
      }
    }
  }
  return HAL_OK;
}


/**
  * @brief  End ongoing Tx transfer on LPUART peripheral (following error detection or Transmit completion).
  * @param  hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_EndTxTransfer(LPUART_HandleTypeDef *hlpuart)
{
  /* Disable TXEIE, TCIE, TXFT interrupts */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_TXEIE | LPUART_CR1_TCIE));

  /* At end of Tx process, restore hlpuart->gState to Ready */
  hlpuart->gState = HAL_LPUART_STATE_READY;
}


/**
  * @brief  End ongoing Rx transfer on LPUART peripheral (following error detection or Reception completion).
  * @param  hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_EndRxTransfer(LPUART_HandleTypeDef *hlpuart)
{
  /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_RXNEIE | LPUART_CR1_PEIE));
  /* Delay 5 kernal clocks */
  LPUART_DelayInLowClock(hlpuart);
  CLEAR_BIT(hlpuart->Instance->CR3, (LPUART_CR3_EIE ));

  /* At end of Rx process, restore hlpuart->RxState to Ready */
  hlpuart->RxState = HAL_LPUART_STATE_READY;

  /* Reset RxIsr function pointer */
  hlpuart->RxISR = NULL;
}


/**
  * @brief DMA LPUART transmit process complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMATransmitCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

  /* DMA Normal mode */
  if (hdma->Init.Mode != DMA_INFINITE_CIRCULAR)
  {
    hlpuart->TxXferCount = 0U;

    /* Disable the DMA transfer for transmit request by resetting the DMAT bit
       in the LPUART CR3 register */
    /* Delay 5 kernal clocks */
    LPUART_DelayInLowClock(hlpuart);
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAT);

    /* Enable the LPUART Transmit Complete Interrupt */
    SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_TCIE);
  }
  /* DMA Circular mode */
  else
  {
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
    /*Call registered Tx complete callback*/
    hlpuart->TxCpltCallback(hlpuart);
#else
    /*Call legacy weak Tx complete callback*/
    HAL_LPUART_TxCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
  }
}

/**
  * @brief DMA LPUART transmit process block complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMATxBlockCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Tx Block complete callback*/
  hlpuart->TxBlockCpltCallback(hlpuart);
#else
  /*Call legacy weak Tx Block complete callback*/
  HAL_LPUART_TxBlockCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA LPUART transmit process half block complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMATxHalfBlockCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Tx Half Block complete callback*/
  hlpuart->TxHalfBlockCpltCallback(hlpuart);
#else
  /*Call legacy weak Tx Half Block complete callback*/
  HAL_LPUART_TxHalfBlockCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA LPUART receive process complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMAReceiveCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

