xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lpuart.c
  /* Tx process is ended, restore hlpuart->gState to Ready */
  hlpuart->gState = HAL_LPUART_STATE_READY;

  /* Cleat TxISR function pointer */
  hlpuart->TxISR = NULL;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Tx complete callback*/
  hlpuart->TxCpltCallback(hlpuart);
#else
  /*Call legacy weak Tx complete callback*/
  HAL_LPUART_TxCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief RX interrupt handler for 7 or 8 bits data word length .
  * @param hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_RxISR_8BIT(LPUART_HandleTypeDef *hlpuart)
{
  uint16_t uhMask = hlpuart->Mask;
  uint16_t uhdata;

  /* Check that a Rx process is ongoing */
  if (hlpuart->RxState == HAL_LPUART_STATE_BUSY_RX)
  {
    uhdata = (uint16_t) READ_REG(hlpuart->Instance->RDR);
    *hlpuart->pRxBuffPtr = (uint8_t)(uhdata & (uint8_t)uhMask);
    hlpuart->pRxBuffPtr++;
    hlpuart->RxXferCount--;

    if (hlpuart->RxXferCount == 0U)
    {
      /* Disable the LPUART Parity Error Interrupt and RXNE interrupts */
      CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_RXNEIE | LPUART_CR1_PEIE));

      /* Delay 5 kernal clocks */
      LPUART_DelayInLowClock(hlpuart);
      /* Disable the LPUART Error Interrupt: (Frame error, noise error, overrun error) */
      CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE);

      /* Rx process is completed, restore hlpuart->RxState to Ready */
      hlpuart->RxState = HAL_LPUART_STATE_READY;

      /* Clear RxISR function pointer */
      hlpuart->RxISR = NULL;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
      /*Call registered Rx complete callback*/
      hlpuart->RxCpltCallback(hlpuart);
#else
      /*Call legacy weak Rx complete callback*/
      HAL_LPUART_RxCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
    }
  }
  else
  {
  }
}

/**
  * @brief RX interrupt handler for 9 bits data word length .
  * @note   Function is called under interruption only, once
  *         interruptions have been enabled by HAL_LPUART_Receive_IT()
  * @param hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_RxISR_16BIT(LPUART_HandleTypeDef *hlpuart)
{
  uint16_t *tmp;
  uint16_t uhMask = hlpuart->Mask;
  uint16_t  uhdata;

  /* Check that a Rx process is ongoing */
  if (hlpuart->RxState == HAL_LPUART_STATE_BUSY_RX)
  {
    uhdata = (uint16_t) READ_REG(hlpuart->Instance->RDR);
    tmp = (uint16_t *) hlpuart->pRxBuffPtr ;
    *tmp = (uint16_t)(uhdata & uhMask);
    hlpuart->pRxBuffPtr += 2U;
    hlpuart->RxXferCount--;

    if (hlpuart->RxXferCount == 0U)
    {
      /* Disable the LPUART Parity Error Interrupt and RXNE interrupt*/
      CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_RXNEIE | LPUART_CR1_PEIE));

      /* Delay 5 kernal clocks */
      LPUART_DelayInLowClock(hlpuart);
      /* Disable the LPUART Error Interrupt: (Frame error, noise error, overrun error) */
      CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE);

      /* Rx process is completed, restore hlpuart->RxState to Ready */
      hlpuart->RxState = HAL_LPUART_STATE_READY;

      /* Clear RxISR function pointer */
      hlpuart->RxISR = NULL;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
      /*Call registered Rx complete callback*/
      hlpuart->RxCpltCallback(hlpuart);
#else
      /*Call legacy weak Rx complete callback*/
      HAL_LPUART_RxCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
    }
  }
  else
  {
  }
}

/**
  * @brief  LPUART Delay 5 kernal clock in LSI/LSE
  * @param  hlpuart LPUART handle.
  * @retval None
  */
void LPUART_DelayInLowClock(LPUART_HandleTypeDef *hlpuart)
{
  uint32_t i = 0;
  uint32_t Rnops = RatioNops;

  if(hlpuart->Instance == LPUART1)
  {
    if((__HAL_RCC_GET_LPUART1_SOURCE() == LPUART_CLOCKSOURCE_LSI) || (__HAL_RCC_GET_LPUART1_SOURCE() == LPUART_CLOCKSOURCE_LSE))
    {
      for(i = 0; i < Rnops; i++)
      {
        __NOP();
      }
    }
  }
  else if(hlpuart->Instance == LPUART2)
  {
    if((__HAL_RCC_GET_LPUART2_SOURCE() == LPUART_CLOCKSOURCE_LSI) || (__HAL_RCC_GET_LPUART2_SOURCE() == LPUART_CLOCKSOURCE_LSE))
    {
      for(i = 0; i < Rnops; i++)
      {
        __NOP();
      }
    }
  }
  else
  {
  }
}

/**
  * @brief  LPUART Delay Ratio Nops
  * @param  hlpuart LPUART handle.
  * @retval None
  */
void LPUART_DelayRatioNops(LPUART_HandleTypeDef *hlpuart)
{
  if(hlpuart->Instance == LPUART1)
  {
    if((__HAL_RCC_GET_LPUART1_SOURCE() == LPUART_CLOCKSOURCE_LSI) || (__HAL_RCC_GET_LPUART1_SOURCE() == LPUART_CLOCKSOURCE_LSE))
    {
      RatioNops = 40 * (SystemCoreClock / 1000000U);
    }
  }
  else if(hlpuart->Instance == LPUART2)
  {
    if((__HAL_RCC_GET_LPUART2_SOURCE() == LPUART_CLOCKSOURCE_LSI) || (__HAL_RCC_GET_LPUART2_SOURCE() == LPUART_CLOCKSOURCE_LSE))
    {
      RatioNops = 40 * (SystemCoreClock / 1000000U);
    }
  }
  else
  {
  }
}

/**
  * @}
  */

#endif /* HAL_LPUART_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT PUYA *****END OF FILE****/
